apemangr/Repetidor-nRF52-SDK-17.1.0/main.c
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>

#include "app_error.h"
#include "app_nus_client.h"
#include "app_nus_server.h"
#include "app_timer.h"
#include "app_uart.h"
#include "app_util.h"
#include "ble.h"
#include "ble_gap.h"
#include "ble_hci.h"
#include "ble_nus.h"
#include "bsp_btn_ble.h"
#include "button.h"
#include "calendar.h"
#include "filesystem.h"
#include "leds.h"
#include "nordic_common.h"
#include "nrf_ble_gatt.h"
#include "nrf_drv_rtc.h"
#include "nrf_rtc.h"
#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"
#include "nrf_pwr_mgmt.h"
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "nrf_sdh_soc.h"
#include "nrf_ble_scan.h"
#include "variables.h"

// Forward declarations
void activate_extended_search_mode(void);

// store_flash Flash_array = {0};
adc_values_t      adc_values      = {0};
config_repeater_t config_repeater = {0};

// /**
//  * @brief Lee todos los registros de historial e imprime la hora de cada uno
//  *
//  * @param file_id       ID del archivo a leer
//  * @return ret_code_t   Código de retorno
//  */
// ret_code_t fds_print_all_record_times(void)
// {
//     ret_code_t         err_code;
//     fds_find_token_t   token          = {0};
//     fds_record_desc_t  record_desc    = {0};
//     fds_flash_record_t flash_record   = {0};
//     uint32_t           record_count   = 0;
//     uint16_t           expected_words =
//     BYTES_TO_WORDS(sizeof(store_history));
//
//     // Iterar a través de todos los registros del file_id
//     while (fds_record_iterate(&record_desc, &token) == NRF_SUCCESS)
//     {
//         // Abrir el registro para lectura
//         err_code = fds_record_open(&record_desc, &flash_record);
//         if (err_code != NRF_SUCCESS)
//         {
//             NRF_LOG_ERROR("Error abriendo registro ID %d",
//             record_desc.record_id); continue;
//         }
//
//         // Verificar que el tamaño sea correcto
//         if (flash_record.p_header->length_words != expected_words)
//         {
//             NRF_LOG_WARNING("Registro ID %d: tamaño incorrecto (%d words)",
//                             record_desc.record_id,
//                             flash_record.p_header->length_words);
//             fds_record_close(&record_desc);
//             continue;
//         }
//
//         // Obtener puntero a los datos del historial
//         const store_history *p_history = (const store_history
//         *)flash_record.p_data;
//
//         // Imprimir la hora del registro
//         // NRF_LOG_INFO("Registro %d: %04d-%02d-%02d",
//         //              record_desc.record_id,
//         //              p_history->year,
//         //              p_history->month,
//         //              p_history->day);
//         // NRF_LOG_INFO("Hora: %02d:%02d:%02d, Contador: %d",
//         //              p_history->hour,
//         //              p_history->minute,
//         //              p_history->second,
//         //              p_history->contador);
//
//         record_count++;
//
//         // Cerrar el registro
//         fds_record_close(&record_desc);
//     }
//
//     NRF_LOG_INFO("=== Total de registros procesados: %d ===", record_count);
//     NRF_LOG_FLUSH();
//     nrf_delay_ms(1000);
//     return NRF_SUCCESS;
// }

// #define RTC_ON_TICKS    (100 * 8)
// #define RTC_SLEEP_TICKS (10 * 8)

NRF_BLE_GATT_DEF(m_gatt); /**< GATT module instance. */
nrfx_rtc_t           m_rtc                     = NRFX_RTC_INSTANCE(2);
bool                 m_device_active           = true;
bool                 m_connected_this_cycle    = false;
bool                 m_extended_mode_on        = false;

bool                 m_reconnection_mode       = false; // BORRAR
bool                 m_emisor_found_this_cycle = false; // BORRAR

// Extended search mode variables
bool                 m_extended_search_active  = false;
uint8_t              m_extended_search_seconds_remaining = 0;
bool                 m_emisor_adv_detected     = false;
uint32_t             m_last_adv_contador       = 0; // Para evitar duplicados

static uint16_t      m_conn_handle             = BLE_CONN_HANDLE_INVALID;
static volatile bool m_rtc_on_flag             = false;
static volatile bool m_rtc_sleep_flag          = false;
static uint16_t      m_ble_nus_max_data_len =
           BLE_GATT_ATT_MTU_DEFAULT - OPCODE_LENGTH - HANDLE_LENGTH;
//

void uart_event_handler(app_uart_evt_t *p_event)
{
    static uint8_t  data_array[BLE_NUS_MAX_DATA_LEN];
    static uint16_t index = 0;
    uint32_t        ret_val;

    switch (p_event->evt_type) {
        /**@snippet [Handling data from UART] */

    case APP_UART_DATA_READY:
        UNUSED_VARIABLE(app_uart_get(&data_array[index]));
        index++;
        if ((data_array[index - 1] == '\n') ||
            (data_array[index - 1] == '\r') ||
            (index >= (m_ble_nus_max_data_len))) {
            NRF_LOG_DEBUG("Ready to send data over BLE NUS client and server");
            NRF_LOG_HEXDUMP_DEBUG(data_array, index);
            app_nus_client_send_data(data_array, index);
            app_nus_server_send_data(data_array, index);
            index = 0;
        }
        break;

        /**@snippet [Handling data from UART] */

    case APP_UART_COMMUNICATION_ERROR:
        NRF_LOG_ERROR("Communication error occurred while handling UART.");
        // No hacer crash, solo loggear el error
        NRF_LOG_ERROR(
                   "UART Communication error code: 0x%X",
                   p_event->data.error_communication);
        break;

    case APP_UART_FIFO_ERROR:
        NRF_LOG_ERROR("Error occurred in FIFO module used by UART.");
        // No hacer crash, solo loggear el error
        NRF_LOG_ERROR("UART FIFO error code: 0x%X", p_event->data.error_code);
        break;

    default:
        break;
    }
}

static void uart_init(void)
{
    ret_code_t                   err_code;

    app_uart_comm_params_t const comm_params = {
               .rx_pin_no    = RX_PIN_NUMBER,
               .tx_pin_no    = TX_PIN_NUMBER,
               .rts_pin_no   = RTS_PIN_NUMBER,
               .cts_pin_no   = CTS_PIN_NUMBER,
               .flow_control = APP_UART_FLOW_CONTROL_DISABLED,
               .use_parity   = false,
               .baud_rate    = UART_BAUDRATE_BAUDRATE_Baud115200};

    APP_UART_FIFO_INIT(
               &comm_params,
               UART_RX_BUF_SIZE,
               UART_TX_BUF_SIZE,
               uart_event_handler,
               APP_IRQ_PRIORITY_LOWEST,
               err_code);

