apemangr/Repetidor-nRF52-SDK-17.1.0/main.c
    if (err_code != NRF_SUCCESS) {
        NRF_LOG_ERROR("UART initialization failed with error: 0x%X", err_code);
        // No hacer crash, continuar sin UART
        return;
    }
    // NRF_LOG_INFO("UART initialized successfully");
}

void rtc_handler(nrfx_rtc_int_type_t int_type)
{
    if (int_type == NRFX_RTC_INT_COMPARE0) {
        m_rtc_on_flag = true;
    }

    else if (int_type == NRFX_RTC_INT_COMPARE1) {
        m_rtc_sleep_flag = true;
    }

    else if (int_type == NRFX_RTC_INT_COMPARE2) {
        calendar_rtc_handler();
        
        // Verificar si estamos en modo activo y quedan 5 segundos antes de dormir
        if (m_device_active && !m_connected_this_cycle && !m_extended_search_active) {
            // Obtener el contador actual y el valor de COMPARE0 (cuando se apagará)
            uint32_t current_counter = nrfx_rtc_counter_get(&m_rtc);
            uint32_t compare0_value = nrf_rtc_cc_get(m_rtc.p_reg, 0);
            
            // Calcular ticks restantes (manejando wrap-around de 24 bits)
            uint32_t ticks_remaining;
            if (compare0_value > current_counter) {
                ticks_remaining = compare0_value - current_counter;
            } else {
                ticks_remaining = (0xFFFFFF - current_counter) + compare0_value;
            }
            
            // Convertir ticks a segundos (8 ticks = 1 segundo)
            uint32_t seconds_remaining = ticks_remaining / 8;
            
            // Si quedan exactamente 5 segundos, activar búsqueda extendida
            if (seconds_remaining == EXTENDED_SEARCH_DURATION_SECONDS) {
                activate_extended_search_mode();
            }
        }
        
        // Manejar countdown de búsqueda extendida
        if (m_extended_search_active && m_extended_search_seconds_remaining > 0) {
            m_extended_search_seconds_remaining--;
            NRF_LOG_RAW_INFO(LOG_INFO " Busqueda extendida: %u segundos restantes...",
                           m_extended_search_seconds_remaining);
            
            if (m_extended_search_seconds_remaining == 0) {
                m_extended_search_active = false;
                NRF_LOG_RAW_INFO(LOG_WARN " Tiempo de busqueda extendida agotado");
                
                // Restaurar escaneo activo (con auto-conexión) si aún estamos en modo activo
                if (m_device_active) {
                    NRF_LOG_RAW_INFO(LOG_INFO " Restaurando modo de escaneo activo...");
                    scan_start_active_mode();
                }
            }
        }
    }
}

void handle_rtc_events(void)
{
    ret_code_t err_code;

    if (m_rtc_on_flag) {
        m_rtc_on_flag = false;

        if (m_device_active) {
            disconnect_all_devices();
            advertising_stop();
            scan_stop();
            app_uart_close();

            nrf_gpio_pin_clear(LED1_PIN);

            m_device_active = false;

            if (!m_connected_this_cycle) {
                NRF_LOG_RAW_INFO(
                           "\n" LOG_INFO " Transicion a \033[1;36mMODO SLEEP "
                           "EXTENDIDO\033[0m");
                uint32_t extended_on_ms = read_time_from_flash(
                           TIEMPO_EXTENDED_ENCENDIDO,
                           DEFAULT_DEVICE_EXTENDED_ON_TIME_MS);
                uint32_t extended_sleep_ms = read_time_from_flash(
                           TIEMPO_EXTENDED_SLEEP,
                           DEFAULT_DEVICE_EXTENDED_SLEEP_TIME_MS);
                NRF_LOG_RAW_INFO(
                           LOG_INFO
                           " Modo extendido ACTIVADO (ON=%u ms, SLEEP=%u ms)",
                           extended_on_ms,
                           extended_sleep_ms);
                m_extended_mode_on = true;
                restart_extended_sleep_rtc();
            }
            else {
                NRF_LOG_RAW_INFO(
                           "\n" LOG_INFO
                           " Transicion a \033[1;36mMODO SLEEP\033[0m");
                uint32_t on_ms = read_time_from_flash(
                           TIEMPO_ENCENDIDO,
                           DEFAULT_DEVICE_ON_TIME_MS);
                uint32_t sleep_ms = read_time_from_flash(
                           TIEMPO_SLEEP,
                           DEFAULT_DEVICE_SLEEP_TIME_MS);
                NRF_LOG_RAW_INFO(
                           LOG_INFO " Modo normal (ON=%u ms, SLEEP=%u ms)",
                           on_ms,
                           sleep_ms);
                m_extended_mode_on = false;
                restart_sleep_rtc();
            }

            m_connected_this_cycle = false;
        }
    }

    if (m_rtc_sleep_flag) {
        m_rtc_sleep_flag = false;

        if (!m_device_active) {
            nrf_gpio_pin_set(LED1_PIN);

            if (m_extended_mode_on) {
                NRF_LOG_RAW_INFO(
                           "\n" LOG_INFO " Transicion a \033[1;32mMODO ACTIVO "
                           "EXTENDIDO\033[0m");
            }
            else {
                NRF_LOG_RAW_INFO(
                           "\n" LOG_INFO
                           " Transicion a \033[1;32mMODO ACTIVO\033[0m");
            }

            save_config_to_flash(&config_repeater);
            NRF_LOG_RAW_INFO(
                       LOG_OK
                       " Guardado de fecha y hora actual: %02u/%02u/%04u, "
                       "%02u:%02u:%02u",
                       m_time.day,
                       m_time.month,
                       m_time.year,
                       m_time.hour,
                       m_time.minute,
                       m_time.second);

            advertising_init();

            // Asegurarse de que la búsqueda extendida esté desactivada al iniciar nuevo ciclo
            m_extended_search_active = false;
            m_extended_search_seconds_remaining = 0;
            
            // Actualizar el payload para mostrar los adc_values
            // Iniciar con escaneo activo (con auto-conexión) al comenzar nuevo ciclo
            scan_start_active_mode();
            advertising_start();
            uart_init();
            m_device_active        = true;
            m_connected_this_cycle = false;

            if (m_extended_mode_on) {
                restart_extended_on_rtc();
            }
            else {
                restart_on_rtc();
            }
        }
    }
}

void rtc_init(void)
{
    // Configuración LFCLK mejorada
    nrf_drv_clock_init();
    nrf_drv_clock_lfclk_request(NULL);

