apemangr/Repetidor-nRF52-SDK-17.1.0/main.c
    // Esperar a que el reloj esté estable
    while (!nrf_drv_clock_lfclk_is_running()) {
    }

    // Configurar RTC con prescaler CORRECTO
    nrfx_rtc_config_t config = NRFX_RTC_DEFAULT_CONFIG;
    config.prescaler         = RTC_PRESCALER;
    ret_code_t err_code      = nrfx_rtc_init(&m_rtc, &config, rtc_handler);
    APP_ERROR_CHECK(err_code);

    // Limpiar contador y comenzar desde cero
    nrfx_rtc_counter_clear(&m_rtc);

    // Configurar comparadores iniciales
    ret_code_t on_ms = read_time_from_flash(
               TIEMPO_ENCENDIDO,
               DEFAULT_DEVICE_ON_TIME_MS);
    // Solo programar el primer evento de 15s
    nrfx_rtc_cc_set(&m_rtc, 0, (on_ms / 1000) * 8, true);

    // Deshabilitar el evento de 20s inicialmente
    nrfx_rtc_cc_disable(&m_rtc, 1);

    // Habilitar interrupciones
    nrfx_rtc_int_enable(
               &m_rtc,
               NRF_RTC_INT_COMPARE0_MASK | NRF_RTC_INT_COMPARE1_MASK |
                          NRF_RTC_INT_COMPARE2_MASK);
    nrfx_rtc_enable(&m_rtc);
    nrf_gpio_pin_set(LED1_PIN);
}

void assert_nrf_callback(uint16_t line_num, const uint8_t *p_file_name)
{
    app_error_handler(0xDEADBEEF, line_num, p_file_name);
}

static void base_timer_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
}

static void ble_nus_chars_received_uart_print(
           uint8_t *p_data,
           uint16_t data_len)
{
    ret_code_t ret_val;

    NRF_LOG_DEBUG("Receiving data.");
    NRF_LOG_HEXDUMP_DEBUG(p_data, data_len);

    for (uint32_t i = 0; i < data_len; i++) {
        uint32_t timeout_counter = 0;
        do {
            ret_val = app_uart_put(p_data[i]);
            if ((ret_val != NRF_SUCCESS) && (ret_val != NRF_ERROR_BUSY)) {
                NRF_LOG_ERROR(
                           "app_uart_put failed for index 0x%04x, error: 0x%X",
                           i,
                           ret_val);
                // No hacer crash, solo salir del loop
                break;
            }

            // Timeout para evitar loops infinitos
            timeout_counter++;
            if (timeout_counter > 10000) {
                NRF_LOG_WARNING("UART timeout, skipping byte %d", i);
                break;
            }
        } while (ret_val == NRF_ERROR_BUSY);
    }
    if (p_data[data_len - 1] == '\r') {
        while (app_uart_put('\n') == NRF_ERROR_BUSY)
            ;
    }
    if (ECHOBACK_BLE_UART_DATA) {
        // Send data back to the peripheral.
        // Esta funcionalidad está deshabilitada para evitar loops
        /*
        do
        {
            ret_val = ble_nus_c_string_send(&m_ble_nus_c, p_data, data_len);
            if ((ret_val != NRF_SUCCESS) && (ret_val != NRF_ERROR_BUSY))
            {
                NRF_LOG_ERROR("Failed sending NUS message. Error 0x%x.",
        ret_val);
                // No hacer crash en caso de error
                break;
            }
        } while (ret_val == NRF_ERROR_BUSY);
        */
    }
}

static bool shutdown_handler(nrf_pwr_mgmt_evt_t event)
{
    ret_code_t err_code;

    err_code = bsp_indication_set(BSP_INDICATE_IDLE);
    APP_ERROR_CHECK(err_code);

    switch (event) {
    case NRF_PWR_MGMT_EVT_PREPARE_WAKEUP:
        // Prepare wakeup buttons.
        err_code = bsp_btn_ble_sleep_mode_prepare();
        APP_ERROR_CHECK(err_code);
        break;

    default:
        break;
    }

    return true;
}

NRF_PWR_MGMT_HANDLER_REGISTER(shutdown_handler, APP_SHUTDOWN_HANDLER_PRIORITY);

void activate_extended_search_mode(void)
{
    if (m_extended_search_active) {
        return; // Ya está activo
    }
    
    NRF_LOG_RAW_INFO("\n" LOG_INFO " \033[1;33mActivando busqueda extendida de ADV\033[0m");
    NRF_LOG_RAW_INFO(LOG_INFO " Escuchando ADV del emisor durante %u segundos...",
                   EXTENDED_SEARCH_DURATION_SECONDS);
    NRF_LOG_RAW_INFO(LOG_WARN " Modo PASIVO: NO se conectara al emisor");
    
    m_extended_search_active = true;
    m_extended_search_seconds_remaining = EXTENDED_SEARCH_DURATION_SECONDS;
    m_emisor_adv_detected = false;
    
    // Iniciar escaneo PASIVO (solo escucha ADV, NO conecta automáticamente)
    scan_start_passive_mode();
}

/**@brief Función para parsear los datos de advertising del emisor
 * 
 * Estructura del ADV (31 bytes):
 * Pos 01-05: Nordic header
 * Pos 06-07: Manufacturer filter
 * Pos 08:    Tipo de perno
 * Pos 09-10: Contador ADV (uint16_t, little-endian)
 * Pos 11-12: ADC1 (V1) (uint16_t, little-endian)
 * Pos 13-14: ADC2 (V2) (uint16_t, little-endian)
 * Pos 15-19: Vacio
 * Pos 20:    Resets
 * Pos 21:    Desgaste
 * Pos 22:    Bateria
 * Pos 23:    Temperatura
 * Pos 24-25: Vacio
 * Pos 26-31: MAC Original
 */
static bool parse_emisor_adv_data(const uint8_t *p_adv_data, 
                                   uint8_t data_len,
                                   uint32_t *p_contador,
                                   uint16_t *p_v1,
                                   uint16_t *p_v2)
{
    // Verificar longitud mínima (debe tener al menos 14 bytes)
    if (data_len < 14 || p_adv_data == NULL) {
        return false;
    }

    // Extraer contador ADV (posición 9-10, índices 8-9 en array)
    // Big-endian: byte alto primero
    *p_contador = ((uint32_t)p_adv_data[8] << 8) | (uint32_t)p_adv_data[9];

    // Extraer V1/ADC1 (posición 11-12, índices 10-11)
    // Big-endian: byte alto primero
    *p_v1 = ((uint16_t)p_adv_data[10] << 8) | (uint16_t)p_adv_data[11];

    // Extraer V2/ADC2 (posición 13-14, índices 12-13)
    // Big-endian: byte alto primero
    *p_v2 = ((uint16_t)p_adv_data[12] << 8) | (uint16_t)p_adv_data[13];

    return true;
}

static void ble_evt_handler(ble_evt_t const *p_ble_evt, void *p_context)
{
    ret_code_t           err_code;
    ble_gap_evt_t const *p_gap_evt = &p_ble_evt->evt.gap_evt;

    switch (p_ble_evt->header.evt_id) {
    case BLE_GAP_EVT_TIMEOUT:
        if (p_gap_evt->params.timeout.src == BLE_GAP_TIMEOUT_SRC_CONN) {
            NRF_LOG_INFO("Connection Request timed out.");
        }
        break;

    case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
        // Pairing not supported.
        err_code = sd_ble_gap_sec_params_reply(
                   p_ble_evt->evt.gap_evt.conn_handle,
                   BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP,
                   NULL,
                   NULL);
        APP_ERROR_CHECK(err_code);
        break;

    case BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST:
        // Accepting parameters requested by peer.
        err_code = sd_ble_gap_conn_param_update(
                   p_gap_evt->conn_handle,
                   &p_gap_evt->params.conn_param_update_request.conn_params);
        APP_ERROR_CHECK(err_code);
        break;

