apemangr/Repetidor-nRF52-SDK-17.1.0/main.c
    case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
    {
        NRF_LOG_DEBUG("PHY update request.");
        ble_gap_phys_t const phys = {
                   .rx_phys = BLE_GAP_PHY_AUTO,
                   .tx_phys = BLE_GAP_PHY_AUTO,
        };
        err_code = sd_ble_gap_phy_update(
                   p_ble_evt->evt.gap_evt.conn_handle,
                   &phys);
        APP_ERROR_CHECK(err_code);
    } break;

    case BLE_GATTC_EVT_TIMEOUT:
        // Disconnect on GATT Client timeout event.
        NRF_LOG_DEBUG("GATT Client Timeout.");
        err_code = sd_ble_gap_disconnect(
                   p_ble_evt->evt.gattc_evt.conn_handle,
                   BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        APP_ERROR_CHECK(err_code);
        break;

    case BLE_GATTS_EVT_TIMEOUT:
        // Disconnect on GATT Server timeout event.
        NRF_LOG_DEBUG("GATT Server Timeout.");
        err_code = sd_ble_gap_disconnect(
                   p_ble_evt->evt.gatts_evt.conn_handle,
                   BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        APP_ERROR_CHECK(err_code);
        break;

    case BLE_GAP_EVT_ADV_REPORT:
    {
        const ble_gap_evt_adv_report_t *p_adv_report = &p_gap_evt->params.adv_report;
        
        // Debug: Imprimir todos los ADV que se reciben durante búsqueda extendida
        // if (m_extended_search_active) {
        //     NRF_LOG_RAW_INFO("\n[ADV] MAC: %02X:%02X:%02X:%02X:%02X:%02X",
        //                    p_adv_report->peer_addr.addr[5],
        //                    p_adv_report->peer_addr.addr[4],
        //                    p_adv_report->peer_addr.addr[3],
        //                    p_adv_report->peer_addr.addr[2],
        //                    p_adv_report->peer_addr.addr[1],
        //                    p_adv_report->peer_addr.addr[0]);

        //  NRF_LOG_RAW_INFO(" RSSI:%d Len:%d", p_adv_report->rssi,p_adv_report->data.len);
        // }
        
        // Solo procesar si estamos en modo de búsqueda extendida
        if (!m_extended_search_active) {
            break;
        }
        
        // Debug: Imprimir MAC objetivo
        // NRF_LOG_RAW_INFO(" [TARGET] %02X:%02X:%02X:%02X:%02X:%02X",
        //                config_repeater.mac_emisor[0],
        //                config_repeater.mac_emisor[1],
        //                config_repeater.mac_emisor[2],
        //                config_repeater.mac_emisor[3],
        //                config_repeater.mac_emisor[4],
        //                config_repeater.mac_emisor[5]);
        
        // Filtrar por MAC del emisor (comparar con inversión de bytes)
        // BLE GAP addr viene como: [0]=LSB ... [5]=MSB
        // config_repeater.mac_emisor está como: [0]=MSB ... [5]=LSB
        bool mac_match = true;
        for (int i = 0; i < 6; i++) {
            if (p_adv_report->peer_addr.addr[i] != config_repeater.mac_emisor[5-i]) {
                mac_match = false;
                break;
            }
        }
        
        if (mac_match) {
            NRF_LOG_RAW_INFO("\n" LOG_OK " \033[1;32m*** MAC MATCH! ***\033[0m");
            
            // Es el emisor objetivo, parsear los datos
            uint32_t contador = 0;
            uint16_t v1 = 0;
            uint16_t v2 = 0;
            
            if (parse_emisor_adv_data(p_adv_report->data.p_data, 
                                      p_adv_report->data.len,
                                      &contador, &v1, &v2)) {
                
                // Verificar si es un contador nuevo (evitar duplicados)
                if (contador != m_last_adv_contador) {
                    m_last_adv_contador = contador;
                    m_emisor_adv_detected = true;
                    
                    NRF_LOG_RAW_INFO("\n" LOG_OK " \033[1;32mADV del EMISOR detectado!\033[0m");
                    NRF_LOG_RAW_INFO(LOG_INFO " Contador=%u, V1=%u, V2=%u", contador, v1, v2);
                    
                    // Crear estructura de historial ADV
                    store_adv_history adv_hist = {
                        .year     = m_time.year,
                        .month    = m_time.month,
                        .day      = m_time.day,
                        .hour     = m_time.hour,
                        .minute   = m_time.minute,
                        .second   = m_time.second,
                        .contador = contador,
                        .V1       = v1,
                        .V2       = v2
                    };
                    
                    // Guardar historial (el sistema calcula automáticamente el offset)
                    // record_id = ADV_HISTORY_RECORD_KEY + (contador / 142)
                    uint16_t history_id = contador / 142;
                    ret_code_t ret = save_adv_history_record(&adv_hist, contador);
                    if (ret == NRF_SUCCESS) {
                        // Imprimir el historial ADV con formato completo
                        char titulo[50];
                        snprintf(titulo, sizeof(titulo), 
                                "Historial ADV \x1B[33m#%u\x1B[0m", history_id);
                        print_adv_history_record(&adv_hist, titulo);
                        
                        // Imprimir el RSSI del ADV detectado
                        NRF_LOG_RAW_INFO(LOG_INFO " RSSI: \x1B[36m%d dBm\x1B[0m\r\n", p_adv_report->rssi);
                        
                        // Marcar que se detectó al emisor en este ciclo
                        m_connected_this_cycle = true;
                        
                        // Desactivar búsqueda extendida (detener escaneo pasivo)
                        // pero NO restaurar modo activo - simplemente esperar a entrar en sleep
                        m_extended_search_active = false;
                        m_extended_search_seconds_remaining = 0;
                        NRF_LOG_RAW_INFO(LOG_INFO " Match detectado. Deteniendo escaneo. Esperando modo sleep...");
                        
                        // Detener el escaneo completamente
                        nrf_ble_scan_stop();
                    } else {
                        NRF_LOG_RAW_INFO(LOG_WARN " Error al guardar historial ADV: %d", ret);
                    }
                }
            }
        }
    } break;

    default:
        break;
    }

